Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/G65B.tmx
Source language: en_us
Languages: zh_cn

source: Chinese philosophies endow my writing with an angelic glamour
zh_cn: 中国给了我“天使般的行文”

source: One afternoon, when I was eight years old, I was going to the grocer's with Mom.
zh_cn: 我8岁那年的一个下午，随妈妈去食品店购物。

source: Pointing at a man riding a bike on the street, Mother said:"He must be madman.
zh_cn: 妈妈指着街上一位骑自行车的男子说：“他肯定是个疯子。

source: He even knows Chinese."
zh_cn: 竟然能看懂中文！”

source: Today I still remember what that man looked like: he had a head of blown-up hair like Einstein's, and what was more frightening was its fiery-red color.
zh_cn: 时至今天我仍然能记清那人的长相：一头爱因斯坦式的爆炸发型，更可怕的是他的头发是火红火红的。

source: At that moment I believed I had seen a real devil.
zh_cn: 那一刻，我觉得自己肯定真的见鬼了。

source: In 1966, I was at the senior high school which offered Latin and French as foreign languages.
zh_cn: 1966年，我读高中，学校的外语课是拉丁文和法文。

source: I was very keen on Latin and French poetry.
zh_cn: 我酷爱拉丁文和法文的诗歌。

source: One day I was browsing through the poetry shelves at the school library.
zh_cn: 一天，在学校的图书馆里，我像往常一样在诗歌书架旁徜徉。

source: When I picked from the shelf an anthology of poems by the American poet Ezra Pound, a thin booklet next to it fell to the floor.
zh_cn: 当我抽出一本美国诗人庞德(Ezra Pound)的诗集时，紧贴它的一本薄薄的小册子掉了下来。

source: I picked it up and found it was a collection of Pound's translations of Chinese classical poetry.
zh_cn: 我拿起来发现这是庞德翻译的中国古典诗词集。

source: I was astonished that there had ever been poetry composed by Chinese.
zh_cn: 我吓了一跳，没想到中国也有诗词。

source: I thumbed through a few pages and was glued to it: never had I read poetry in such refreshing styles.
zh_cn: 随手翻翻我立即就被吸引住了：从未见过如此清新风格的诗词。

source: One week later, I went to Arthur Waley, an English sinologist of the early20th century, and borrowed his The Opium War, which surprised me again.
zh_cn: 一周后，我找到了20世纪初英国汉学家阿瑟·韦利(Arthur Waley)写的《鸦片战争》，让我以一次惊奇。

source: In English textbooks of history not a single word about the war was mentioned and the average Englishmen simply did not know anything about it.
zh_cn: 在英国历史教科书中，从未提过这场战争，一般的英国人对此也一无所知。

source: It was but a small and short-lived battle or a trade conflict taking place locally in East Asia, so it deserved no mention at all when compared with the more important events happening then in the large number of British colonies in Southeast Asia, Central Asia, Africa and Australia.
zh_cn: 在大英帝国的历史长河里，这段时间十分短暂，东亚局部发生的“小战役”微不足道，在鸦片战争那一年，英帝国广袤的海外属地东南亚、中亚、非洲、澳洲等地区，有许多更值得着墨的重大事件。

source: However, after I had read The Opium War, I felt like reading more about China, so I borrowed Waley's translation of Chinese poetry.
zh_cn: 但是，当我读完《鸦片战争》后仍意犹未尽，马上找来韦利翻译的中国古诗词。

source: It was beyond my imagination indeed that Chinese poets could have produced poetry so moving and written in such elegant language.
zh_cn: 中国诗人能创作出如此高雅动人的诗歌，实在超乎我的想象。

source: A couple of months later, newspapers carried the news that Edinburgh University was going to offer a course of the Chinese language.
zh_cn: 几个月后，报纸登出了爱丁堡大学将要开设中文课程的消息。

source: That night I lay in bed and, unable to go to sleep, thought to myself:why not take the course and learn the Chinese language in a systematic way, so that I would be able to appreciate Chinese poetry in the original.
zh_cn: 那晚我躺下后，辗转反侧，思量道：为何不去系统地学习中文，这样自己不就能体会到中国古诗的原意么？

source: The next morning I called the administration office of the university and made an appointment to see the Dean of the Department.
zh_cn: 第二天一早，我便打电话给大学行政办公室，与主任预约。

source: Three days later I went to see him, taking a train that lasted two hours, but he forgot that he had made an appointment with a strange young man who wanted to learn the Chinese language.
zh_cn: 三天后，我在火车两小时赴约，主任却将这位奇怪的小伙子想学中文这事忘在脑后，我扑空了。

source: Back home I contacted the Dean again, trying to convince him of my resolve to learn Chinese.
zh_cn: 回家后我又联系了主任，以表达学习中文的决心。

source: The Chinese Department managed to enroll only five students from across the country just before the course got started.
zh_cn: 直到开课前，中文系千辛万苦总算从全英国招到5名学生。

source: When I told my high school Latin and French teachers that I was going to study Chinese, the Latin teacher, a pedantic old gentleman, kept extolling me for my courage while the French teacher,a madam, shaking her head and shrugging her shoulders, tried to talk me out of it."
zh_cn: 我告诉高中的拉丁文和法语老师自己将去学习中文时，拉丁文老学究连连赞赏我超乎寻常的勇敢，而法文女老师一个劲儿的摇头耸肩，规劝我放弃。

source: Do not waste your time at the university, better take something, or anything that is useful."
zh_cn: “大学的时间可不能浪费，做点有用的事多好，啥事都行！”

source: When I first heard the language spoken from a recorder in class, I was really disappointed. it sounded as if all the sounds had one tone.
zh_cn: 第一次在大学课堂上通过录音机听中文，我心灰意冷。听起来，所有的音只有一种调。

source: Little wonder that westerners said Chinese was a mysterious language.
zh_cn: 难怪西方人认为中文是天书。

source: By the end of the first semester, I was still terribly confused about the four tones of spoken Chinese, and the voices from the tape were simply a din.
zh_cn: 第一学期末，我还是对中文四声的发音摸不着头脑，磁带里中文对话从头到尾都是哇啦哇啦。

source: We Chinese majors were looked upon as "archaeological scholars".
zh_cn: 我们中文系的学生在别人眼中是“考古学者”。

source: I still remember, when I first went to the library for a book on Chinese grammar, what the housewife-like librarian said to me. She looked at me over her spectacles and said:"Chinese grammar?
zh_cn: 我还记得第一次去图书馆借中文语法书时，那位家庭主妇模样的管理员眼睛从架在鼻子上的眼镜上方端详了我一会然后说：“中文语法？

source: That language has long been out of use, hasn't it?"
zh_cn: 都多久没人用这门语言了啊！不是么？”

source: During my college days in Edinburgh, I saw only a couple of Chinese immigrants from Mainland China in the 1930s.
zh_cn: 在爱丁堡度过的大学时光中，我只见过20世纪30年代从中国大陆移民。

source: There were a few small Chinese restaurants run by immigrants from Hong Kong, but they all spoke Cantonese.
zh_cn: 还有几家餐馆，是香港来的移民经营的，但是他们只说粤语。

source: On two or three occasions some Chinese officials from the Chinese Embassy in London visited our Chinese classes, and each time they came they praised the excellent situation of the "cultural revolution", not mentioning anything about Chinese traditional culture that I had been so interested in.
zh_cn: 中国驻英大使馆的中国官员造访过我们的中文课，每次来，他们都对“文革”的大好形势吹捧一番，对我着迷的中国传统文化只字不提。

source: When I asked them about Confucius, Mencius and the Chinese classics, they said that China was engaged in breaking the four-olds.
zh_cn: 我问起孔子、孟子和中国古典文学时，得到的回答是中国正在“破四旧”。

source: Hearing that, I was disappointed and sorry for China.
zh_cn: 听到这，我很失望，并为中国感到惋惜。

source: Chinese culture is like the go game whose rules are clear and simple and easy to follow, but until you begin to play it, you do not see the mystery and complexity involved in it.
zh_cn: 中国文化如同围棋，游戏规则简单明了，几下子就可以解释清楚，但是真正玩起来才能体味其中的奥妙。

source: It has no formal conjugation of verbs or inflections in gender and number.
zh_cn: 看起来，它并没有动词变化，没有阴性阳性和单复数。

source: When you describe any event, all you need to do is to provide the necessary adverbs indicating the time at which the event occurs, such as "just now","yesterday"and"tomorrow'.
zh_cn: 当讲述一件事情时，只需冠上相应的副词便可，比如“刚才”、“昨天”和“明天”。

source: These grammatical phenomena made the beginner excited at first, thinking that he was lucky enough not to have to bother about such irregularities of verbs as in French.
zh_cn: 这些让西方的初学者开始时兴奋无比，觉得自己侥幸逃过法语难懂的动词不规则变化。

source: But it is not until he has gone far enough into it that he realizes that just because the Chinese language has too few rules, the beginner often finds himself at a loss what to do.
zh_cn: 然而当他们的中文入门后，就会很快发现正因为规则太少，所以更加无所适从。

source: "Chinese Puzzle" in English is a synonym of a difficult problem, and "Chinese Box" refers to a problem that is too complex to solve.
zh_cn: Chinese Puzzle（“中国之谜”）一词在英文中是“难题”的同义词；Chinese Box则是比喻一个问题非常棘手。

source: When a westerner does not understand what you are talking about, he would say,"You are speaking Chinese".
zh_cn: 西方人在不明白对方的谈话时会说：“你这是在讲中文！”

source: After graduating from university, I retreated to a remote rural area in Scotland and, earned a living by farming on a piece of land I reclained from the wilderness, modeling on the philosophy of Lao Zi, Zhuang Zi and Tao Yuanming whose lifestyle I admired.
zh_cn: 大学毕业后，由于痴迷老庄和陶渊明的处世方式，我决定模仿中国古代圣哲，隐居到苏格兰深山乡野里，自己开了块荒地，躬耕自食。

source: I know that Tao Yunming had integrated himself with Nature.
zh_cn: 我知道陶渊明就是这样融入自然的。

source: While farming , I studied ancient Chinese philosophies, yuanqu, and novels and stories of the Ming and Qing dynasties.
zh_cn: 我一边工作一边学习中国古代哲学、元曲和明清小说。

source: I also wrote articles for newspapers and journals , to make some extra money.
zh_cn: 并且为报刊撰稿赚取外快。

source: The editors thought highly of the style, saying that the style of the discourse was like an angel flying.
zh_cn: 编辑们对我的英文风格赞赏有加，连连夸赞我如“天使般行文”。

source: I know that I had benefited from the techniques of Chinese classical writing, i.e, the four steps: introduction, elucidation, transition and conclusion, and the brilliant Chinese culture hand enlightened me with inexhaustible inspirations.
zh_cn: 只有我自己深知，这是得益于对中文写作手法的融会贯通。这包含四步：起、承、转、合。智慧的中国文人令我思如泉涌。

source: Even today I keep writing English prose, drawing on the writing techniques and logic of Chinese literature.
zh_cn: 直至今日，我仍坚持用中国文学的技巧和逻辑来写英文散文。
